name = ...  # здесь Ваш код
surname = ...  # здесь Ваш код
age = ...  # здесь Ваш код

# Определите типы данных и идентификаторы в памяти
# Дайте смысловые имена переменным


# вывод типа и идентификатора каждой переменной
print(...)  # допишите код
print(...)  # допишите код
print(...)  # допишите код
